index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>index</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="index"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2016-04-10T00:56+0900"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">index</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">CHUNITHM Rate Analyzer</h2>
<div class="outline-text-2" id="text-1">


<p>
CHUNITHM のレート上げのお供に！
</p>
<ul>
<li>どの曲で何点出せばレートが上がるのか

</li>
<li>今のスコアで出せる最大レート (BEST 枠１位のスコアを１０連続で出した場合)
</li>
</ul>


<p>
などを簡単に調べられるツールです。
</p>
<p>
(計算方法は <a href="http://twitter.com/capue">@capue</a> さんほかの調査によります)
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">注意</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">対象譜面</h4>
<div class="outline-text-4" id="text-1-1-1">


<p>
レベル１１～１３＋で、ランクＡ以上が出ているもの (ランクＡを達成していない譜面は未プレイ扱い)。
</p>
<p>
※レベル１１未満の曲がレートの対象に入っている方 (BEST レート 13 未満)
は正しく計算することができません。
</p>
</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">スコア情報の取得について</h4>
<div class="outline-text-4" id="text-1-1-2">


<p>
このツールは CHUNITHM NET の内部で使われている URL に直接アクセスすることでスコア情報を収集します。これが「通常想定し得ない方法」による、あるいは「不正な」サービスの利用と解釈された場合、利用規約によってアカウント停止等の処分が行われる可能性があります。
</p>
<p>
<span style="text-decoration:underline;">ツールの性質を理解したうえで、各自の判断でご利用ください。このツールを使用したことで起こったトラブルに作者は対応しません。</span>
</p>
<p>
なお、類似のツールの使用に対して何らかの対策が行われた場合、あるいは公式に表明があった場合、これを類似ツールが「不正」であるという公式見解とみなして公開を取り下げます。
</p>
</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">使い方</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">インストール</h4>
<div class="outline-text-4" id="text-1-2-1">




<a href="javascript:(function()%7Bfunction%20callback()%7B(function(%24)%7Bvar%20jQuery%3D%24%3B%24(%22head%22).append(%22%3Cscript%20src%3D'http%3A%2F%2Fzk-phi.github.io%2FCHUNITHMRateAnalyzer%2Fchunithm.js'%3E%22)%7D)(jQuery.noConflict(true))%7Dvar%20s%3Ddocument.createElement(%22script%22)%3Bs.src%3D%22https%3A%2F%2Fajax.googleapis.com%2Fajax%2Flibs%2Fjquery%2F1.7.1%2Fjquery.min.js%22%3Bif(s.addEventListener)%7Bs.addEventListener(%22load%22%2Ccallback%2Cfalse)%7Delse%20if(s.readyState)%7Bs.onreadystatechange%3Dcallback%7Ddocument.body.appendChild(s)%3B%7D)()"> このリンク </a>

<p>
をお気に入りに追加 (ブックマークバーにドラッグ＆ドロップ or リンクをコピーして貼り付け)。
</p>
<p>
※ IE 以外のブラウザでどうぞ (スマホでも動くらしい…？)
</p>
</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">起動</h4>
<div class="outline-text-4" id="text-1-2-2">


<ol>
<li>CHUNITHM NET にログイン

</li>
<li>利用権があることを確認

</li>
<li><b>CHUNITHM NET の画面を出したまま</b> 、保存しておいたリンクを開く
</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">協力者求む！ (2016/04/09～)</h3>
<div class="outline-text-3" id="text-1-3">


<p>
<b>CHUNITHM Rate Analyzer は誰でも開発に参加できます</b> 。
</p>
<p>
曲の追加だけなら <b>プログラミングも不要</b> なので、新曲の追加時など、いち早く最新のデータを配信するためにぜひ協力してください！
</p>
<p>
配信前に僕が簡単にチェックをするので、自信がなくても大丈夫です (いつも協力してくれている方には、僕のチェックなしで即配信できる権限を渡す可能性もあります)。
</p>

</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">曲データの追加方法</h4>
<div class="outline-text-4" id="text-1-3-1">


<ol>
<li>(GitHub のアカウントを取得)

</li>
<li>CHUNITHM Rate Analyzer を fork (自分のアカウントにコピー) する

</li>
<li><code>chunithm.js</code> を開いて、曲リストの入っている場所を探す (100 行目あたり)

</li>
<li>曲リストの <b>一番後ろに</b> 新しい曲を追加する

<ul>
<li>適当な曲データをコピペして、
</li>
<li><code>id</code> を新曲の ID に変更 (調べ方は後述)
</li>
<li><code>level</code> を 「赤譜面なら <code>2</code> / 紫譜面なら <code>3</code> 」 に変更
</li>
<li><code>rate_base</code> を新曲の譜面定数に変更
</li>
<li><code>name</code> を新曲の曲名 (赤譜面なら 曲名＋「赤」) に変更

</li>
</ul>

</li>
<li><code>chunithm.js</code> を commit (保存) する

<ul>
<li>「○○を追加」など、どこを変えたかわかるようなメモを残してください

</li>
</ul>

</li>
<li>pull request を送る

<ul>
<li>メッセージは適当（「追加しといたのでアプデよろしく」とか）で OK
</li>
</ul>

</li>
</ol>


<p>
僕に pull request が届いたら、大丈夫そうか簡単にチェックして、アップデートを配信します。
</p>
<ul>
<li id="sec-1-3-1-1">曲 ID の確認方法<br/>

<ol>
<li>CHUNITHM NET にログイン

</li>
<li>レコードを開いて、調べたい曲がリストに表示されている状態にする

</li>
<li>右クリック → 要素の検証

</li>
<li>調べたい曲のある場所を探す
</li>
</ol>


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">Q&amp;A</h3>
<div class="outline-text-3" id="text-1-4">


<dl>
<dt>で、結局どうしたらレート上がるの？</dt><dd>
<p>
     BEST 枠 (上位３０曲) のスコアを伸ばすか、BEST 枠に入っていない曲を
     BEST 枠入りさせて BEST 枠平均を上げましょう。
</p>
</dd>
<dt>レートの仕組みを詳しく知りたい</dt><dd>
<p>
     <a href="http://d.hatena.ne.jp/risette14/">リゼット (14 新) 推奨日記</a> さんに詳しい考察があります。
</p>
</dd>
<dt>スコアがすべて 0 になってるんだけど？</dt><dd>
<p>
     CHUNITHM NET 利用権があるか確認してください。
</p></dd>
</dl>



</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5">リンク</h3>
<div class="outline-text-3" id="text-1-5">


<dl>
<dt><a href="http://d.hatena.ne.jp/risette14/">リゼット(14新)推奨日記</a></dt><dd>
<p>
     このツールのもとになっている、レートのシステムや計算式、譜面定数の考察があります。
</p>
</dd>
<dt><a href="http://www.ginjake.net/score/">チュウニズムスコアツール</a></dt><dd>
<p>
     全譜面のスコアをまとめて一覧したり、他のプレーヤーと比較できるツール。スコア取得の仕組みを実装するときに参考にしました。
</p></dd>
</dl>

</div>
</div>
</div>
</div>

<div id="postamble">


</div>
</body>
</html>
